In [1]:
import pandas as pd
import numpy as np

In [2]:
cidades = pd.DataFrame(
    [
        ['Paraná', 'Londrina', 575377, 1356.00],
        ['São Paulo', 'São Carlos', 254484, 1508.00],
        ['Santa Catarina', 'Florianópolis', 508826, 1798.00],
        ['Paraná', 'Curitiba', 1963726, 2293.00],
        ['São Paulo', 'Campinas', 1223237, 1710.00],
    ], columns=['Estado', 'Cidade', 'Habitantes', 'Salário-Médio']
)

In [3]:
cidades.shape

(5, 4)

In [4]:
cidades

           Estado         Cidade  Habitantes  Salário-Médio
0          Paraná       Londrina      575377         1356.0
1       São Paulo     São Carlos      254484         1508.0
2  Santa Catarina  Florianópolis      508826         1798.0
3          Paraná       Curitiba     1963726         2293.0
4       São Paulo       Campinas     1223237         1710.0

In [5]:
cidades.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Estado         5 non-null      object
 1   Cidade         5 non-null      object
 2   Habitantes     5 non-null      int64
 3   Salário-Médio  5 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 292.0+ bytes

In [6]:
cidades.columns

Index(['Estado', 'Cidade', 'Habitantes', 'Salário-Médio'], dtype='object')

In [7]:
cidades.count()

Estado           5
Cidade           5
Habitantes       5
Salário-Médio    5
dtype: int64

In [12]:
cidades.describe()

         Habitantes  Salário-Médio
count  5.000000e+00       5.000000
mean   9.051300e+05    1733.000000
std    6.911859e+05     357.459089
min    2.544840e+05    1356.000000
25%    5.088260e+05    1508.000000
50%    5.753770e+05    1710.000000
75%    1.223237e+06    1798.000000
max    1.963726e+06    2293.000000

In [15]:
cidades.dtypes

Estado            object
Cidade            object
Habitantes         int64
Salário-Médio    float64
dtype: object

In [16]:
# adicionando uma coluna
cidades['Data'] = ['3-8-2021', '3-9-2021', '3-10-2021', '3-11-2021', '3-12-2021']

In [17]:
cidades

           Estado         Cidade  Habitantes  Salário-Médio       Data
0          Paraná       Londrina      575377         1356.0   3-8-2021
1       São Paulo     São Carlos      254484         1508.0   3-9-2021
2  Santa Catarina  Florianópolis      508826         1798.0  3-10-2021
3          Paraná       Curitiba     1963726         2293.0  3-11-2021
4       São Paulo       Campinas     1223237         1710.0  3-12-2021

In [22]:
# convertendo a coluna Data em Datetime
cidades['Data'] = pd.to_datetime(cidades['Data'], format='%d-%m-%Y')

In [24]:
cidades.dtypes

Estado                   object
Cidade                   object
Habitantes                int64
Salário-Médio           float64
Data             datetime64[ns]
dtype: object

In [26]:
cidades.rename(columns={'Habitantes': 'N Habitantes', 'Data': 'Data Censo'}, inplace=True)

In [28]:
cidades.head(1)

   Estado    Cidade  N Habitantes  Salário-Médio Data Censo
0  Paraná  Londrina        575377         1356.0 2021-08-03

In [31]:
cidades.loc[[1,2]]

           Estado         Cidade  N Habitantes  Salário-Médio Data Censo
1       São Paulo     São Carlos        254484         1508.0 2021-09-03
2  Santa Catarina  Florianópolis        508826         1798.0 2021-10-03

In [32]:
cidades.index

RangeIndex(start=0, stop=5, step=1)

In [33]:
cidades.iloc[0]

Estado                        Paraná
Cidade                      Londrina
N Habitantes                  575377
Salário-Médio                 1356.0
Data Censo       2021-08-03 00:00:00
Name: 0, dtype: object

In [37]:
cidades.iloc[[4]]

      Estado    Cidade  N Habitantes  Salário-Médio Data Censo
4  São Paulo  Campinas       1223237         1710.0 2021-12-03

In [46]:
cidades.iloc[::-2, 1:3]

          Cidade  N Habitantes
4       Campinas       1223237
2  Florianópolis        508826
0       Londrina        575377

In [49]:
cidades.iloc[:, [3,1,2,3]]

   Salário-Médio         Cidade  N Habitantes  Salário-Médio
0         1356.0       Londrina        575377         1356.0
1         1508.0     São Carlos        254484         1508.0
2         1798.0  Florianópolis        508826         1798.0
3         2293.0       Curitiba       1963726         2293.0
4         1710.0       Campinas       1223237         1710.0

In [52]:
# Adicionando colunas
# df.insert( posicao, 'nome', [valores])
cidades.insert(2, 'Sigla-Repetido', ['PR', 'SP', 'SC', 'PR', 'SP'])

In [53]:
cidades

,Estado,Cidade,Sigla-Repetido,Sigla,N Habitantes,Salário-Médio,Data Censo
0,Paraná,Londrina,PR,PR,575377,1356.0,2021-08-03
1,São Paulo,São Carlos,SP,SP,254484,1508.0,2021-09-03
2,Santa Catarina,Florianópolis,SC,SC,508826,1798.0,2021-10-03
3,Paraná,Curitiba,PR,PR,1963726,2293.0,2021-11-03
4,São Paulo,Campinas,SP,SP,1223237,1710.0,2021-12-03

In [54]:
# cidades.pop('Sigla-Repetido') ou 
cidades = cidades.drop(['Sigla-Repetido'], axis=1)

In [55]:
cidades

           Estado         Cidade Sigla  N Habitantes  Salário-Médio Data Censo
0          Paraná       Londrina    PR        575377         1356.0 2021-08-03
1       São Paulo     São Carlos    SP        254484         1508.0 2021-09-03
2  Santa Catarina  Florianópolis    SC        508826         1798.0 2021-10-03
3          Paraná       Curitiba    PR       1963726         2293.0 2021-11-03
4       São Paulo       Campinas    SP       1223237         1710.0 2021-12-03